Revit 2026 API

# WiringType Enumeration

---

An enumerated type to list all wiring types.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum WiringType
```
```vb
Public Enumeration WiringType
```
```cpp
public enum class WiringType
```
```fsharp
type WiringType
```

| Member name | Value | Description |
| --- | --- | --- |
| Arc | 0 | Arc wiring is used to indicate wiring that is concealed within walls, ceilings, or floors. |
| Chamfer | 1 | Chamfered wiring can be used to indicate wiring that is exposed. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace